---
kind: property
id: P:Autodesk.Revit.UI.UIControlledApplication.ProductIsRS
source: html/7ffcb711-729c-229b-063e-6acda6aefeb0.htm
---
# Autodesk.Revit.UI.UIControlledApplication.ProductIsRS Property

Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.

## Syntax (C#)
```csharp
public bool ProductIsRS { get; }
```